Repository: Blueve/katrain
Catalog: katrain/i18n/locales/*/LC_MESSAGES/katrain.po
Languages: nl

source: pass-button-text
nl: Pas

source: tab:info
nl: Info

source: Info:PV
nl: PV: {pv}

source: board-pass
nl: pass

source: closedlabel:scoregraph
nl: Score Graph

source: Starting default Kata failed
nl: Starting KataGo with command '{command}' failed with error {error}. If on MacOS, see the manual on how to use brew to install katago first, and add it to your path or 'engine/katago' setting.

source: Failed to load SGF
nl: Failed to load SGF. Parse Error: {error}

source: Info:AI thoughts
nl: AI thought process: {thoughts}

source: tab:winrate
nl: Win Rate

source: Info:undo predicted PV
nl: Predicted follow-up: {pv}

source: tab:notes
nl: Notes

source: SGF start message
nl: Moves marked 'X' indicate the top move according to KataGo, those with a square are moves that lose less than 0.5 points

source: Info:teaching undo
nl: Move was automatically undone in teaching mode.

source: Failed to import from clipboard
nl: Failed to import game from clipboard: {error} Clipboard contents: {contents}...

source: Info:policy best
nl: Top policy move was {move} ({probability:.1%}).

source: Info:policy rank
nl: Move was #{rank} according to policy ({probability:.2%}).

source: Engine died unexpectedly
nl: Engine died unexpectedly without sending output, possibly due to out of memory: {e}

source: board-game-end
nl: game end

source: Starting Kata failed
nl: Starting kata with command '{command}' failed with error {error}. Please make sure the 'katago' value under 'engine' in settings points to the correct KataGo executable.

source: closedlabel:movestats
nl: Move Stats

source: Info:top move
nl: Predicted top move was {top_move} ({score}).

source: Info:score
nl: Score: {score}

source: Info:point loss
nl: Estimated point loss: {points_lost:.1f}

source: tab:score
nl: Score

source: Info:best move
nl: Move was predicted best move

source: tab:points
nl: Point Loss

source: Info:winrate
nl: Win rate: {winrate}

source: closedlabel:info&notes
nl: Move Info & Notes

source: btn:Analysis
nl: Analysis

source: btn:Play
nl: Play

source: stats:winrate
nl: Win Rate

source: stats:pointslost
nl: Points Lost

source: stats:score
nl: Estimated Score

source: stats:pointsgained
nl: Points Gained

source: SGF Notes Hint
nl: Your SGF notes for this position here.

source: analysis:territory
nl: Expected Territory

source: analysis:topmoves
nl: Top Moves

source: analysis:dots
nl: Show Dots

source: analysis:nextmoves
nl: Next Moves

source: analysis:policy
nl: Policy Moves

source: ai-ponder
nl: This simply indicates the Engine status, going from green (idle) to orange (processing queries). It turns red when the engine has crashed or fails to start.

source: menu:newgame
nl: New Game

source: menu:load
nl: Load Game

source: menu:save
nl: Save Game

source: menu:lang
nl: Language

source: menu:settings
nl: General Settings

source: menu:playersetup
nl: Player Setup

source: analysis:sweep
nl: Fast analysis of all moves

source: analysis:equalize
nl: Equalize visits of potential moves

source: analysis:aimove
nl: Force AI Move

source: analysis:extra
nl: Deeper analysis

source: undo-button-text
nl: Undo

source: menu:support
nl: Support or Contribute

source: wait-before-equalize
nl: Wait for initial analysis to complete before requesting a refinement.

source: game:teaching
nl: Teaching Game

source: game:normal
nl: Normal Game

source: player:human
nl: AI

source: player:type
nl: Player

source: player:ai
nl: AI

source: game:teach
nl: Teaching Game

source: menu:clocksettings
nl: Timer Settings

source: menu:teachsettings
nl: Teaching Game Settings

source: menu:aisettings
nl: AI Settings

source: timer settings
nl: Adjust Timer Settings

source: update timer
nl: Update Timer Settings

source: byoyomi length
nl: Time per Byo-yomi Period

source: byoyomi periods
nl: Number of Periods

source: japanese
nl: Japanese Rules

source: aga
nl: American Go Association Rules

source: new game
nl: Start New Game

source: ruleset
nl: Rules

source: avoids replaying
nl: 'avoids replaying identical games

source: korean
nl: Korean Rules

source: chinese
nl: Chinese Rules

source: non square board hint
nl: Use x:y (e.g. 19:9) to play on a non-square board.

source: handicap hint
nl: Note that handicaps above 9 are not supported on non-square boards.

source: New Game title
nl: Setup New Game

source: sgf written
nl: SGF with analysis written to {file_name}

source: ainame:jigo
nl: KataJigo

source: aihelp:policy
nl: Plays the top move from the policy network, without any reading. Strength is mainly affected by `model` in engine settings. The opening moves setting affects how many moves in the opening are more random.

source: ainame:policy
nl: Policy

source: ainame:scoreloss
nl: Score Loss

source: aihelp:default
nl: Full strength KataGo AI. Strength is mainly affected by `max_visits` and `model` in the general settings `engine` section.

source: aihelp:jigo
nl: Will try to win by a set amount of points (default 0.5), without further restrictions.

source: aihelp:scoreloss
nl: Plays moves that lead to more points lost with lower probability. Likely to play more varied/weaker with higher visits settings.

source: ainame:default
nl: KataGo

source: strength:kyu
nl: k

source: strength:dan
nl: d

source: aihelp:p:weighted
nl: Plays moves according to policy probability, with `weaken_fac` influencing how much more likely weaker moves are played. A high negative value plays like the `Policy` AI.`pick_override` determines when top move is chosen without randomness, and `lower_bound` determines the lower bound policy value that is allowed.

source: aihelp:p:pick
nl: Picks `pick_n + pick_frac * <number of legal moves>` at random and plays the best one. For `pick_frac=1` plays like the `Policy` AI. Plays top move if policy value is above `pick_override` to avoid obvious mistakes.

source: ai:p:influence
nl: Influential Style

source: ai:p:local
nl: Respond Locally

source: aihelp:p:tenuki
nl: Picks `pick_n + pick_frac * <number of legal moves>` weighted away from the last move and plays the best one. Plays top move if policy value is above `pick_override` to avoid obvious mistakes.

source: ai:scoreloss
nl: Score Loss

source: aihelp:p:influence
nl: Picks moves biased above the `threshold` line and plays the best one.Increase `line_weight` to penalize moves near the edge more. Stops strategy after the 'endgame' fraction of the board is filled.

source: ai:default
nl: KataGo

source: ai:p:tenuki
nl: Tenuki Style

source: ai:p:pick
nl: Blinded Policy

source: ai:p:weighted
nl: Policy Weighted

source: ai:policy
nl: Policy

source: ai:jigo
nl: KataJigo

source: aihelp:p:local
nl: Picks moves biased below the `threshold` line and plays the best one.Increase `line_weight` to penalize moves near the center more. Stops strategy after the 'endgame' fraction of the board is filled.

source: aihelp:p:territory
nl: Picks moves biased below the `threshold` line and plays the best one.Increase `line_weight` to penalize moves near the center more. Stops strategy after the 'endgame' fraction of the board is filled.

source: ai:p:territory
nl: Respond Locally

source: save dots
nl: Save in SGF

source: num undos
nl: Number of undos

source: teacher settings
nl: Edit Teacher Settings

source: point loss threshold
nl: Point loss greater than

source: dot color
nl: Colour (fixed)

source: show ai dots
nl: Show dots/SGF comments for AI players

source: restarting engine
nl: Restarting Engine after Settings Change.

source: lock ai when teaching
nl: Disable analysis while in teach mode

source: show last n dots
nl: Show dots for the last <this many> moves

source: update teacher
nl: Update Teaching Game Settings

source: engine:max_visits
nl: Maximum number of visits in analysis

source: engine:max_time
nl: Maximum time for analysis

source: engine:fast_visits
nl: Maximum number of visits in fast analysis

source: engine:config
nl: Path to KataGo config file

source: general:sgf_save
nl: Path for saving SGF files

source: general:sgf_load
nl: Path for loading SGF files

source: general:debug_level
nl: Debug level in the console

source: general settings title
nl: General and Engine Settings

source: engine settings
nl: KataGo Engine Settings

source: engine:model
nl: Path to KataGo model file

source: general:anim_pv_time
nl: Time between moves when animating a sequence

source: engine:katago
nl: Path to KataGo executable

source: general:debug_level:hint
nl: Use 0 for little output, 1 for getting details when reporting errors

source: engine:max_time:hint
nl: Time in seconds

source: engine:time:hint
nl: Time in seconds

source: engine:katago:hint
nl: Leave blank to use included executable

source: file not found
nl: Path does not exist

source: engine:wide_root_noise:hint
nl: Use a value of 0.02-0.1 to show more possible moves, at the cost of weakening analysis.

source: engine:wide_root_noise
nl: Wide root noise (increases variety of moves considered)

source: lock ai when playing
nl: Disable analysis while in play mode

source: Select AI
nl: Select AI strategy to configure
